###############################################################################
# Created by write_sdc
###############################################################################
current_design adder64
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 40.0000 
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[10]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[11]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[12]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[13]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[14]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[15]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[16]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[17]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[18]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[19]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[20]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[21]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[22]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[23]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[24]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[25]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[26]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[27]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[28]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[29]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[30]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[31]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[32]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[33]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[34]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[35]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[36]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[37]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[38]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[39]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[40]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[41]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[42]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[43]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[44]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[45]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[46]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[47]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[48]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[49]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[50]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[51]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[52]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[53]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[54]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[55]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[56]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[57]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[58]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[59]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[60]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[61]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[62]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[63]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[8]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {A[9]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {A[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[10]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[11]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[12]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[13]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[14]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[15]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[16]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[17]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[18]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[19]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[20]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[21]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[22]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[23]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[24]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[25]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[26]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[27]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[28]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[29]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[30]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[31]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[32]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[33]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[34]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[35]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[36]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[37]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[38]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[39]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[40]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[41]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[42]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[43]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[44]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[45]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[46]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[47]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[48]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[49]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[50]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[51]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[52]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[53]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[54]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[55]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[56]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[57]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[58]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[59]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[60]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[61]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[62]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[63]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[8]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {B[9]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {B[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cin}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cin}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Cout}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Cout}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[32]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[32]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[33]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[33]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[34]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[34]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[35]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[35]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[36]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[36]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[37]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[37]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[38]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[38]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[39]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[39]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[40]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[40]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[41]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[41]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[42]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[42]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[43]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[43]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[44]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[44]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[45]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[45]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[46]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[46]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[47]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[47]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[48]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[48]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[49]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[49]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[50]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[50]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[51]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[51]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[52]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[52]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[53]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[53]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[54]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[54]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[55]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[55]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[56]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[56]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[57]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[57]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[58]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[58]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[59]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[59]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[60]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[60]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[61]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[61]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[62]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[62]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[63]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[63]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {Sum[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {Sum[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0500 [get_ports {Cout}]
###############################################################################
# Design Rules
###############################################################################
