OpenROAD v2.0-27463-gc3bd3a2184 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
[INFO ODB-0227] LEF file: /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lef/sky130_fd_sc_hd.tlef, created 13 layers, 25 vias
[INFO ODB-0227] LEF file: /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lef/sky130_fd_sc_hd_merged.lef, created 441 library cells
link_design adder64
source /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
write_db ./results/sky130hd/adder64/base/1_synth.odb
write_sdc -no_timestamp ./results/sky130hd/adder64/base/1_synth.sdc
Elapsed time: 0:00.38[h:]min:sec. CPU time: user 0.33 sys 0.04 (98%). Peak memory: 112620KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0            109 28b42b5dd1a5ed4d30d0
