OpenROAD v2.0-27463-gc3bd3a2184 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64/base/2_1_floorplan.odb
source /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
write_db ./results/sky130hd/adder64/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.32[h:]min:sec. CPU time: user 0.30 sys 0.02 (99%). Peak memory: 110716KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            108 19ecc4f4846c57a7fdab
