OpenROAD v2.0-27463-gc3bd3a2184 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64/base/2_2_floorplan_macro.odb
source /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 3900 tapcells.
write_db ./results/sky130hd/adder64/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.34[h:]min:sec. CPU time: user 0.30 sys 0.03 (97%). Peak memory: 111784KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            109 16785c36bac31106de40
