OpenROAD v2.0-27463-gc3bd3a2184 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64/base/3_place.odb
source /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
clock_tree_synthesis -sink_clustering_enable -repair_clock_nets
[INFO CTS-0050] Root buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0051] Sink buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0052] The following clock buffers will be used for CTS:
                    sky130_fd_sc_hd__clkbuf_16
[INFO CTS-0049] Characterization buffer is sky130_fd_sc_hd__clkbuf_16.
[WARNING CTS-0083] No clock nets have been found.
[INFO CTS-0008] TritonCTS found 0 clock nets.
[WARNING CTS-0082] No valid clock nets in the design.
estimate_parasitics -placement
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL            9023.8 u
legalized HPWL           9365.0 u
delta HPWL                    4 %

estimate_parasitics -placement
repair_timing -setup_margin 0 -hold_margin 0 -repair_tns 100 -match_cell_footprint -verbose
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove CloneMove SplitLoadMove 
[INFO RSZ-0098] No setup violations found
[INFO RSZ-0033] No hold violations found.
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL            9365.0 u
legalized HPWL           9365.0 u
delta HPWL                    0 %

Report metrics stage 4, cts final...
No registers in design

==========================================================================
cts final report_design_area
--------------------------------------------------------------------------
Design area 3719 um^2 1% utilization.
write_db ./results/sky130hd/adder64/base/4_1_cts.odb
write_sdc -no_timestamp ./results/sky130hd/adder64/base/4_cts.sdc
Elapsed time: 0:00.91[h:]min:sec. CPU time: user 0.84 sys 0.06 (99%). Peak memory: 154636KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
4_1_cts                            0            151 0c66721c93b06ed62a4d
