OpenROAD v2.0-27463-gc3bd3a2184 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64/base/5_2_route.odb
source /home/rohit/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[WARNING STA-0450] virtual clock clk can not be propagated.
filler_placement "sky130_fd_sc_hd__fill_1 sky130_fd_sc_hd__fill_2 sky130_fd_sc_hd__fill_4 sky130_fd_sc_hd__fill_8"
[INFO DPL-0001] Placed 34792 filler instances.
write_db ./results/sky130hd/adder64/base/5_3_fillcell.odb
Elapsed time: 0:00.45[h:]min:sec. CPU time: user 0.40 sys 0.04 (97%). Peak memory: 152260KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0            148 189a34a9ef4693c81940
